Revit 2026 API

# ImageFailures Properties

---

The BuiltInFailuresImageFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BadViewType | Image Instances can't be placed in 3D Views. |
|  | InvalidHeight | The image height must be must be no more than 30000 feet. |
|  | InvalidWidth | The image width must be must be no more than 30000 feet. |

#### Reference

BuiltInFailuresImageFailures Class

Autodesk.Revit.DB Namespace